![](pic/mysql2.jpg)

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\dydeh\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 1")
  result = self._query(query)

'Connected: root@galaxy'

## <span style="color:red">** 연습문제 **</span>

In [10]:
%%sql
select * from employees

 * mysql://root:***@localhost/galaxy
20 rows affected.

[(100, 'Steven', 'King', 'SKING', '515.123.4567', datetime.date(1987, 6, 17), 'AD_PRES', Decimal('24000.00'), None, None, 90),
 (101, 'Neena', 'Kochhar', 'NKOCHHAR', '515.123.4568', datetime.date(1989, 9, 21), 'AD_VP', Decimal('17000.00'), None, 100, 90),
 (102, 'Lex', 'De Haan', 'LDEHAAN', '515.123.4569', datetime.date(1993, 1, 13), 'AD_VP', Decimal('17000.00'), None, 100, 90),
 (103, 'Alexander', 'Hunold', 'AHUNOLD', '590.423.4567', datetime.date(1990, 1, 3), 'IT_PROG', Decimal('9000.00'), None, 102, 60),
 (104, 'Bruce', 'Ernst', 'BERNST', '590.423.4568', datetime.date(1991, 5, 21), 'IT_PROG', Decimal('6000.00'), None, 103, 60),
 (107, 'Diana', 'Lorentz', 'DLORENTZ', '590.423.5567', datetime.date(1999, 2, 7), 'IT_PROG', Decimal('4200.00'), None, 103, 60),
 (124, 'Kevin', 'Mourgos', 'KMOURGOS', '650.123.5234', datetime.date(1999, 11, 16), 'ST_MAN', Decimal('5800.00'), None, 100, 50),
 (141, 'Trenna', 'Rajs', 'TRAJS', '650.121.8009', datetime.date(1995, 10, 17), 'ST_CLERK', Decimal('3500.00'), None, 124, 50),
 (142, 'Curtis', 'Davies', 'CDAVIES', '650.121.2994', datetime.date(1997, 1, 29), 'ST_CLERK', Decimal('3100.00'), None, 124, 50),
 (143, 'Randall', 'Matos', 'RMATOS', '650.121.2874', datetime.date(1998, 3, 15), 'ST_CLERK', Decimal('2600.00'), None, 124, 50),
 (144, 'Peter', 'Vargas', 'PVARGAS', '650.121.2004', datetime.date(1998, 7, 9), 'ST_CLERK', Decimal('2500.00'), None, 124, 50),
 (149, 'Eleni', 'Zlotkey', 'EZLOTKEY', '011.44.1344.429018', datetime.date(2000, 1, 29), 'SA_MAN', Decimal('10500.00'), Decimal('0.20'), 100, 80),
 (174, 'Ellen', 'Abel', 'EABEL', '011.44.1644.429267', datetime.date(1996, 5, 11), 'SA_REP', Decimal('11000.00'), Decimal('0.30'), 149, 80),
 (176, 'Jonathon', 'Taylor', 'JTAYLOR', '011.44.1644.429265', datetime.date(1998, 3, 24), 'SA_REP', Decimal('8600.00'), Decimal('0.20'), 149, 80),
 (178, 'Kimberely', 'Grant', 'KGRANT', '011.44.1644.429263', datetime.date(1999, 5, 24), 'SA_REP', Decimal('7000.00'), Decimal('0.15'), 149, None),
 (200, 'Jennifer', 'Whalen', 'JWHALEN', '515.123.4444', datetime.date(1987, 9, 17), 'AD_ASST', Decimal('4400.00'), None, 101, 10),
 (201, 'Michael', 'Hartstein', 'MHARTSTE', '515.123.5555', datetime.date(1996, 2, 17), 'MK_MAN', Decimal('13000.00'), None, 100, 20),
 (202, 'Pat', 'Fay', 'PFAY', '603.123.6666', datetime.date(1997, 8, 17), 'MK_REP', Decimal('6000.00'), None, 201, 20),
 (205, 'Shelley', 'Higgins', 'SHIGGINS', '515.123.8080', datetime.date(1994, 6, 7), 'AC_MGR', Decimal('12000.00'), None, 101, 110),
 (206, 'William', 'Gietz', 'WGIETZ', '515.123.8181', datetime.date(1994, 6, 7), 'AC_ACCOUNT', Decimal('8300.00'), None, 205, 110)]

<br><br>
<span style="color:red">[문제 1]</span>   
모든 사원에 대하여 급여 최고액, 최저액, 총액, 평균액을 표시하라.   
결과는 반올림하여 정수로 나타내라.

In [7]:
%%sql
select round(max(salary),0), round(min(salary),0), round(sum(salary),0), round(avg(salary),0)
from employees

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(Decimal('24000'), Decimal('2500'), Decimal('175500'), Decimal('8775'))]

<br><br>
<span style="color:red">[문제 2]</span>   
문제 1의 SQL 문을 수정하여, 각 업무 유형별로 급여 최고액, 최저액, 총액, 평균액을 표시하라.  
결과는 반올림하여 정수로 나타내라.

In [13]:
%%sql
select job_id, round(max(salary),0), round(min(salary),0), round(sum(salary),0), round(avg(salary),0)
from employees
group by job_id

 * mysql://root:***@localhost/galaxy
12 rows affected.

[('AC_ACCOUNT', Decimal('8300'), Decimal('8300'), Decimal('8300'), Decimal('8300')),
 ('AC_MGR', Decimal('12000'), Decimal('12000'), Decimal('12000'), Decimal('12000')),
 ('AD_ASST', Decimal('4400'), Decimal('4400'), Decimal('4400'), Decimal('4400')),
 ('AD_PRES', Decimal('24000'), Decimal('24000'), Decimal('24000'), Decimal('24000')),
 ('AD_VP', Decimal('17000'), Decimal('17000'), Decimal('34000'), Decimal('17000')),
 ('IT_PROG', Decimal('9000'), Decimal('4200'), Decimal('19200'), Decimal('6400')),
 ('MK_MAN', Decimal('13000'), Decimal('13000'), Decimal('13000'), Decimal('13000')),
 ('MK_REP', Decimal('6000'), Decimal('6000'), Decimal('6000'), Decimal('6000')),
 ('SA_MAN', Decimal('10500'), Decimal('10500'), Decimal('10500'), Decimal('10500')),
 ('SA_REP', Decimal('11000'), Decimal('7000'), Decimal('26600'), Decimal('8867')),
 ('ST_CLERK', Decimal('3500'), Decimal('2500'), Decimal('11700'), Decimal('2925')),
 ('ST_MAN', Decimal('5800'), Decimal('5800'), Decimal('5800'), Decimal('5800'))]

<br><br>
<span style="color:red">[문제 3]</span>   
업무가 동일한 사원 수를 표시하라.

<span style="color:orange">
AC_ACCOUNT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1  
AC_MGR&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;1  
...

In [15]:
%%sql
select job_id, count(job_id) as 사원수
from employees
group by job_id

 * mysql://root:***@localhost/galaxy
12 rows affected.

[('AC_ACCOUNT', 1),
 ('AC_MGR', 1),
 ('AD_ASST', 1),
 ('AD_PRES', 1),
 ('AD_VP', 2),
 ('IT_PROG', 3),
 ('MK_MAN', 1),
 ('MK_REP', 1),
 ('SA_MAN', 1),
 ('SA_REP', 3),
 ('ST_CLERK', 4),
 ('ST_MAN', 1)]

<br><br>
<span style="color:red">[문제 4]</span>   
관리자는 모두 몇명인가?

<span style="color:orange">
8

In [58]:
%%sql
select count(distinct manager_id) as 관리자
from employees

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(8,)]

<br><br>
<span style="color:red">[문제 5]</span>   
관리자 번호 및 해당 관리자에 속한 사원의 최저 급여를 표시하라.   
관리자를 알 수 없는 사원 및 최저 급여가 6000 미만인 그룹은 제외시키고, 결과를 급여에 대한 내림차순으로 정렬하라.

<span style="color:orange">
102&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;9000   
205&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;8300  
149&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;7000

In [82]:
%%sql
select manager_id, round(min(salary),0)
from employees
group by manager_id
having min(salary) > 6000 and manager_id>0
order by min(salary) desc

 * mysql://root:***@localhost/galaxy
3 rows affected.

[(102, Decimal('9000')), (205, Decimal('8300')), (149, Decimal('7000'))]

<br><br>
<span style="color:red">[문제 6]</span>   
각 부서에 대하여 부서이름, 위치, 사원 수, 평균 급여를 표시하라.   
평균 급여는 반올림하여 소수 둘째 자리까지 나타내라.

<br><br>
<span style="color:red">[문제 7]</span>   
총 사원 수 및 1995, 1996, 1997, 1998년에 입사한 사원 수를 표시하라.

In [114]:
%%sql
select count(employee_id) as '총 사원수', 
count(case when hire_date like '1995%' then employee_id end) as '1995년',
count(case when hire_date like '1996%' then employee_id end) as '1996년',
count(case when hire_date like '1997%' then employee_id end) as '1997년',
count(case when hire_date like '1998%' then employee_id end) as '1998년'
from employees

 * mysql://root:***@localhost/galaxy
1 rows affected.

[(20, 1, 2, 2, 3)]